{
  "backend/main.mo": "Defines an empty Internet Computer actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report documenting a high-confidence UI feature adding a gentle fade-in animation to the romantic hero image, including affected files and components.",
  "frontend-file-summaries.txt": "Meta file containing human-written summaries of key frontend source files and their responsibilities.",
  "frontend/index.css": "Tailwind base stylesheet defining global design tokens, themes (light, dark, romantic, playful), and color variables using OKLCH.",
  "frontend/index.html": "HTML entry point setting the Valentine-themed page title and mounting the React app to the root element.",
  "frontend/src/App.tsx": "Main React application rendering the Valentine interaction flow with Yes/No logic, romantic theming, animated hero image, and a celebration state.",
  "frontend/src/components/CelebrationEffect.tsx": "Overlay component that renders animated floating hearts and confetti with randomized positions, timing, and colors.",
  "frontend/src/components/PersonalizationPanel.tsx": "Empty component file reserved for a future personalization UI.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages a backend actor instance based on Internet Identity authentication, using React Query for caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useLocalStorageState.ts": "Empty placeholder for a custom hook intended to sync React state with localStorage.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty module noting that no backend queries are required for this frontend-only experience.",
  "frontend/src/index.css": "No summary available.",
  "frontend/src/lib/personalizationDefaults.ts": "Empty placeholder file intended to define default personalization settings and related types.",
  "frontend/src/main.tsx": "React application bootstrap that sets up React Query, Internet Identity provider, global styles, and renders the App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend sources, and extending the theme with CSS-variable-driven colors, fonts, radii, shadows, and custom animations (accordion, float, bounce, celebration). It integrates typography, container queries, and animation plugins and defines a centered container layout.",
  "project_state.json": "Project metadata snapshot describing an ICP starter app with a placeholder Motoko backend and a React + Tailwind + shadcn/ui Valentine-themed frontend. It enumerates existing features, versions, and a narrative summary of the playful Yes/No interaction, authentication context, and celebration effects."
}