{
  "backend/main.mo": "Defines an empty Motoko actor with no methods or state, serving as a placeholder backend.",
  "feature_evidence.json": "Machine-readable report documenting removed personalization features, affected files, components, test requirements, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style mapping that briefly describes the purpose and behavior of key frontend source files.",
  "frontend/index.css": "Tailwind CSS base layer defining global design tokens, OKLCH color variables, and light/dark theme styling.",
  "frontend/index.html": "HTML entry point that sets the page title and mounts the React app to the root element.",
  "frontend/src/App.tsx": "Main React application implementing a fixed Valentine interaction flow with Yes/No buttons, playful No-button movement, and a celebratory success state.",
  "frontend/src/components/CelebrationEffect.tsx": "Overlay component that renders animated floating hearts and confetti using randomized positions, delays, and durations.",
  "frontend/src/components/PersonalizationPanel.tsx": "Empty file, indicating the personalization UI component has been removed or stubbed out.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an Internet Computer backend actor, recreating it when the authenticated identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and logout.",
  "frontend/src/hooks/useLocalStorageState.ts": "Empty file, indicating the localStorage-backed state hook has been removed.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty module noting that no backend queries exist and all state is handled in the frontend.",
  "frontend/src/index.css": "No summary available.",
  "frontend/src/lib/personalizationDefaults.ts": "Empty file where personalization default values and types were previously defined.",
  "frontend/src/main.tsx": "Frontend entry point that creates the React root and renders the App wrapped with React Query's QueryClientProvider and the InternetIdentityProvider for authentication context.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode strategy, plugins, and an extended theme with custom OKLCH color tokens, fonts, animations, and layout settings.",
  "project_state.json": "Machine-readable snapshot of the project describing schema/versioning, a high-level project summary, and a catalog of existing features covering the ICP backend, React frontend, authentication, tooling, and UI infrastructure."
}